WcfHarness/WcfHarness/RequestXmls/ChangePassword_ByUserId.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ChangePassword xmlns="http://www.tavisca.com/Vexiere/IIdentity/2013/01">
      <resetPasswordRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:CurrentPassword>zaq1ZAQ!</a:CurrentPassword>
        <a:NewPassword>xsw2XSW@</a:NewPassword>
        <a:UserIdentifier i:type="a:IdBasedUserIdentifier">
          <a:Id>9</a:Id>
        </a:UserIdentifier>
      </resetPasswordRequest>
    </ChangePassword>
  </s:Body>
</s:Envelope>